Tekla Open API Reference for Tekla Structures 2025
MarkAttributes Constructor
Overload List
Name | Description
Mark.MarkAttributes(ModelObject)
 Creates a new default mark attributes instance that loads standard attributes.
Mark.MarkAttributes(ModelObject, String)
 Creates a new mark attributes instance that loads the specified attributes.
Top
See Also
Reference
Mark.MarkAttributes Class
Tekla.Structures.Drawing Namespace